IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.1.cpp
/* ESP32_Sarimesh_Core  vr. 4.1.0
 * Last updated 20230515 by MF
 * 
 * 
 * 
 */


// support for CORE_DEBUG level
#ifdef CORE_DEBUG_LEVEL
#undef CORE_DEBUG_LEVEL
#endif

#define CORE_DEBUG_LEVEL 5
//#define LOG_LOCAL_LEVEL ESP_LOG_DEBUG

bool  debug_disabled = false ;   // indicates if most of the debugging messages are disabled for performance 
bool  wait_default_config = false ; // wait for defaults loading by pushing button at startup


//********************** include FreeRTOS API support ************************
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/timers.h"
#include "driver/pcnt.h"  /////
#include "ESP32_RTOS_Support_Functions.h"
#include "esp_task.h"    
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <freertos/semphr.h>
#include <freertos/queue.h>

// include arduino basics
#include "Arduino.h"

#define INTERRUPT_ATTR IRAM_ATTR 

// task sync and IPP support
SemaphoreHandle_t i2c_mutex_v; 
SemaphoreHandle_t SPI_mutex_v;
SemaphoreHandle_t LocationManager_mutex_v;
SemaphoreHandle_t ClockManager_mutex_v;
SemaphoreHandle_t LoRa_Device_Handler_mutex_v;
QueueHandle_t xQueue_in;
QueueHandle_t xQueue_APRS;
QueueHandle_t xQueue_native;
QueueHandle_t msg_queue;
QueueHandle_t xQueue_park;
QueueHandle_t xQueue_native_park;

// create multiple tasks handles
TaskHandle_t BCN_Controller_Handle;          // handles BCN engine operation
TaskHandle_t LocationManager_handle;         // handles device location
TaskHandle_t LoRa_Device_Handler_handle;         // handles device location
TaskHandle_t ClockManager_handle;            // handles device local realtime clock
TaskHandle_t DisplayManager_handle;          // handle local device displays
TaskHandle_t AuxResourceManager_handle;      // handles leds, buttons, buzzer, etc.
TaskHandle_t LoRaManager_handle;             // handles low level LoRa devices for setup, send and receive operations
TaskHandle_t BeaconController_handle;        // controls beacon send/receive functionalities
TaskHandle_t MQTT_Manager_handle;            // controls MQTT send/receive functionalitie
TaskHandle_t Task3;                          // used by tft_....

// task service routines prototypes
void BCN_Controller( void * pvParameters );      //BCN_Controller: Beacon sender/receiver controller task
void LocationManager( void * pvParameters );         // handles device location
void LoRa_Device_Handler( void * pvParameters );         // handles device location
void ClockManager( void * pvParameters );            // handles device local realtime clock
void DisplayManager( void * pvParameters );          // handle local device displays
void AuxResourceManager( void * pvParameters );      // handles leds, buttons, buzzer, etc.
void LoRaManager( void * pvParameters );             // handles low level LoRa devices for setup, send and receive operations
void BeaconController( void * pvParameters );        // controls beacon send/receive functionalities
void MQTT_Manager( void * pvParameters );            // controls MQTT send/receive functionalitie
volatile bool Task3_flag = true ;  //  starts APRS  packet tansmission via Task_3 

// RT Task enable flags
volatile bool BCN_Controller_flag = false ;  //  starts BCN_Controller
volatile bool LocationManager_flag = false ;         // handles device geo location infos
volatile bool LoRa_Device_Handler_flag = false ;     // handles device geo location infos
volatile bool ClockManager_flag = false ;            // handles device local realtime clock
volatile bool DisplayManager_flag = false ;          // handle local device displays
volatile bool AuxResourceManager_flag = false ;      // handles leds, buttons, buzzer, etc.
volatile bool LoRaManager_flag = false ;             // handles low level LoRa devices for setup, send and receive operations
volatile bool BeaconController_flag = false ;        // controls beacon send/receive functionalities
volatile bool MQTT_Manager_flag = false ;            // controls MQTT send/receive functionalitie

volatile bool is_at_defaults = false ;
#ifdef FORCE_DEFAULTS                   // if true force default configuration 
  bool force_config_init = true ;
#else
  bool force_config_init = false ;
#endif

#ifdef SAVE_PROTECT                    // if false inhibits configuration saving for most parameters 
  volatile bool save_config_enable = false ;
#else
  volatile bool save_config_enable = true ;
#endif

//******************************* Device Configuration related data  ***************************
#include "Device_Conf.h"

//*******************************  config data, flags & parameters - Operation mode  ***************************
//#include "default_configuration_data.h"   // defines default srtConfig configuration class and instance
// allocate device configuration structure
strConfig  ESP_Config ;

//*************   wire library to support I2C driver ****************
#include "Wire.h"

//******************** I2C_Support_Functions ************************************
#include "I2C_Support_Functions.h"

//******************** RemoteDebug Support  ************************************
#ifndef FORCE_SERIAL_DEBUG
#include "RemoteDebug.h"     //https://github.com/JoaoLopesF/RemoteDebug
RemoteDebug Debug ;
#endif

// **********************  on board button , leds from cpu or via PCF1684 parallel IO expander support setup *******************
// PCF857484 on board IO expander I2C driven: this is the I2C address used by the device on board
// libreria utilizzata https://www.mischianti.org/2019/01/02/pcf8574-i2c-digital-i-o-expander-fast-easy-usage/
//#include "PCF8574.h"
#include "PortExpander8574_Support_Functions.h"

// create pcf8574 object  to manage pcf8574 attached devices
PCF8574 pcf8574(0x21);

//*******************************  FRAM Support  ***************************
// https://github.com/FrankBoesing/FastCRC/blob/master/examples/FastCRC_validate/FastCRC_validate.ino
//#include <util/crc16.h>
#include <FastCRC.h>
FastCRC32 CRC32;
#include "FRAM.h"    //     URL: https://github.com/RobTillaart/FRAM_I2C
FRAM fram;

