IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.1.cpp
// support for arduino-timer
#include <arduino-timer.h>


#ifdef LORA_FUNCTIONS_ENABLE    // disables all LoRa related functionalities for core system stability evaluation

  // ********************************** LoRa  Libraries and parameters *************************************
  #include <RadioLib.h>
  #include "LoRa_Device_Handler.h"

  // ********************************** loraprs app support *************************************
  #include "loraprs_config.h"
  #include "loraprs_service.h"
  //  volatile bool aprsis_available = false; 
  extern LoraPrs::Service loraPrsService;

  //****************************** LoRa Native Beacon support ***************************************
  //supports LoRa beconing based on a binary payload serialized via the LoRa Serialization library
  // https://github.com/thesolarnomad/lora-serialization 

  #include "beacon_aux_functions.h"

  //*********************** ShortBeacon functionality support *********************
  // extern volatile uint8_t EncapType ;                       // 0=LoRa   1=APRS


  // ********************************** LoRa  Libraries and parameters *************************************
  #include <RadioLib.h>
  #include "LoRa_Device_Handler.h"

  String  LoRaDevice = LORA_DEVICE ;   // E22_400M30S , E22_400M22S, RFM98 , RA_01S
 
  volatile  uint8_t LoraDeviceType = -1 ;   // lora device generation -1= not jet identified  0=first generation 1=second generation 
  SX1268 lora_2g = new Module(L_SS, L_DI0, L_RST,L_BUSY);
  SX1278 lora_1g = new Module(L_SS, L_DI0, L_RST,L_BUSY);

  // ********************************** loraprs app support *************************************
  #include "loraprs_config.h"
  #include "loraprs_service.h"

  //****************************** LoRa Native Beacon support ***************************************
  //supports LoRa beconing based on a binary payload serialized via the LoRa Serialization library
  // https://github.com/thesolarnomad/lora-serialization 

  #include "beacon_aux_functions.h"

  //*********************** ShortBeacon functionality support *********************
  //  extern volatile uint8_t EncapType ;                       // 0=LoRa   1=APRS
  #include "BCN_Structs.h"
  #include "Lora_Radiolib_Support_Functions.h"
#endif // LORA_FUNCTIONS_ENABLE


//*************************** Tickers definition *****************************************
#include <Ticker.h>
Ticker tkSecond;                 // 1 Second - Timer 
Ticker tk30Second;              // 30 Second - Timer 
Ticker tk60WebClient;           // 30 Second - Timer 
Ticker tk_mqtt;                 // mqtt  - Timer 
Ticker tkTimeSync;              // TimeSyncCheck  - Timer 
Ticker tkDutyCycle;             // DutyCycle  - Timer 
Ticker tk60NTPClient ;
Ticker tk_ps_mon;               // power supply monitor  - Timer  5 sec default
Ticker tk_upstream_mon;            // 
Ticker tk_aprsis_mon;            // 

void reconnectAprsis();
void Second_Tick();
void DutyCycle_Monitor(void);
void loop_global(void);
void OTA_loop(void);
void printLocalTime();



void setup(){
  //******************** initilize standard serial connection and console ***************************
  SerialDebug_Setup();  // startup SerialDebug 

#ifdef FORCE_SERIAL_DEBUG  
  debugA("ESP32_LoRa_Sarimesh_Core Vr. %s \r", SW_Revision.c_str() ); // Serial.println("");
  debugA( "Last Update 20230110 by MF" );
  debugA("setup():SerialDebug consolle is BIDIRECTIONAL now...\r" ); 
#else
  Serial.printf("ESP32_LoRa_Sarimesh_Core Vr. %s \r\n", SW_Revision.c_str() ); // Serial.println("");
  Serial.printf( "Last Update 20230110 by MF\r\n" );
  Serial.printf("setup(): SerialDebug consolle is DISPLAY only now...\r\n" ); 
  delay(500); // Wait a time
#endif

  //******************************* Load default HW_Device_Configuration ****************************
  HW_Set_Defaults(); // always try to start with our default HW device configuration
  show_HW_Device_Config() ;

#ifdef DEBUG_DISABLED
  Serial.print("\r\n\r\n========= System Debug features are disabled by build definition ===========\r\n");
  debug_disabled = true ;
#endif


// startup kernel CORE_LOGGING support
  LastFunction = __func__ ;
  debugA("Setup kernel CORE_LOGGING debug support\r"); // will be shown in the terminal
  Serial.setDebugOutput(false);
  esp_log_level_set("*", ESP_LOG_NONE);
/*  
  ESP_LOGD("EXAMPLE", "This doesn't show");
  log_v("Verbose");
  log_d("Debug");
  log_i("Info");
  log_w("Warning"); 
  log_e("Error");
*/

//******************** create i2c_mutex_v ***************************
    i2c_mutex_v = xSemaphoreCreateMutex(); 
    if (i2c_mutex_v != NULL) { 
       debugA("i2c_mutex_v Mutex successfully created"); 
     };

//******************** create SPI_mutex_v ***************************
    SPI_mutex_v = xSemaphoreCreateMutex(); 
    if (SPI_mutex_v != NULL) { 
       debugA("SPI_mutex_v Mutex successfully created"); 
       };  

//******************** create LocationManager_mutex_v ***************************
    LocationManager_mutex_v = xSemaphoreCreateMutex(); 
    if (LocationManager_mutex_v != NULL) { 
       debugA("LocationManager_mutex_v Mutex successfully created"); 
       };

//******************** create ClockManager_mutex_v ***************************
    ClockManager_mutex_v = xSemaphoreCreateMutex(); 
    if (ClockManager_mutex_v != NULL) { 
       debugA("ClockManager_mutex_v Mutex successfully created"); 
       };


//******************** create LoRa_Device_Handler_mutex_v ***************************
    LoRa_Device_Handler_mutex_v = xSemaphoreCreateMutex(); 
    if (LoRa_Device_Handler_mutex_v != NULL) { 
       debugA("LoRa_Device_Handler_mutex_v Mutex successfully created"); 
       };

//******************** create LoRa_Device_Handler InterProcessCommunication ***************************
    if(Setup_LDH_IPP()){
       debugA("Setup_LDH_IPP: successfully completed"); 
        } 
    else {
       debugA("Setup_LDH_IPP: failed... no IPP available... aborting  "); 
       };

//*********************  setup WDT *******************
// freeRTOS system tuning https://github.com/espressif/arduino-esp32/blob/master/cores/esp32/esp32-hal.h#L76-L91
  disableCore0WDT();
  disableCore1WDT();
  disableLoopWDT();
//  feedLoopWDT();


//******************** disable master SW reset if present ***************************
  if(reboot_pin){
     pinMode(reboot_pin, OUTPUT);      // disable master reset  
     digitalWrite(reboot_pin, HIGH);
     };

//******************** quick buzzer disable ***************************
if(buzzer_pin){
  pinMode(buzzer_pin, OUTPUT);      // buzzer driver for PIO12
  buzzer_disable();
  };

