IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.1.cpp
#endif   //  OLED_MOD

//*********************************** TFT DISPLAY HW  setup  *******************
#ifdef TFT_MOD
  has_ST77XX = true ;
  #ifdef USE_ADAFRUIT_TFT_LIB
    Serial.print( "Using ADAFRUIT_SPI_TFT LIB\r\n" );
  #else
    Serial.print( "Using TFT_eSPI LIB\r\n" );
  #endif

  #ifdef USE_ADAFRUIT_TFT_LIB     // using USE_ADAFRUIT_TFT_LIB
    tft.init(135, 240);           // Init ST7789 240x135
    tft.fillScreen(ST77XX_BLACK);
    //  tft.setFont(&FreeMono9pt7b);
    tft.setFont(&Basic_Comical_Regular_NC12pt7b);
    //  tft.setFont();
    tft.setRotation(1);
    tft.fillScreen(ST77XX_BLACK);
    //  tftPrintTest();
    tft.setCursor(0, 0); 
    //  tft.setTextFont(GFXFF);
    //  tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextColor(ST77XX_GREEN);
    tft.setCursor(0, 30); tft.print("         Welcome to");
    tft.setCursor(0, 60); tft.print("   Esp32 LoRa Beacon ");
    tft.setCursor(0, 90); tft.print("       by SARIMESH");
  #else          //  Using TFT_eSPI LIB
    tft.init(); 
    tft.setRotation(3);
    tft.loadFont(Final_Comics_18);  
    digitalWrite(25, HIGH);
    tft.fillScreen(TFT_BLACK);
  #endif

  vTaskDelay(pdMS_TO_TICKS(3000)); // let's display our banner for few seconda!

  //************************* send booting message on display... *********************
  // let's start TFT display test task (Task3)
  if(selftest_debug){
    // setup tft test cases: disabled ; to re-enable uncomment....
    #ifdef USE_ADAFRUIT_TFT_LIB   // uses task2 for loop
      // tft_adafruit test case
      setup_tft_adafruit();
    #else
      // tft_eSPI_test case
      setup_tft_eSPI();
    #endif
  };   // selftest_debug

  if(has_ST77XX){  // adafruit TFT_LIB
    #ifdef USE_ADAFRUIT_TFT_LIB
      tft.fillScreen(ST77XX_BLACK);
      tft.setTextWrap(false);
      tft.setTextColor(ST77XX_GREEN);
      tft.setTextSize(1);
      tft.setCursor(10, 40);  tft.print(VersionBanner.c_str());
      tft.setCursor(30, 60);  tft.print("Booting....(TFTLib)");
    #else   // eSPI
      tft.fillScreen(TFT_BLACK);
      tft.setTextColor(TFT_GREEN, TFT_BLACK);
      tft.setCursor(10, 40);  tft.print(VersionBanner.c_str());
      tft.setCursor(30, 60);  tft.print("Booting....(eSPILib)");
    #endif
  };   // has_ST77XX

#endif   //  TFT_MOD

//*********************************** SD_card  setup  *******************
// Setup SD_Card test case
#ifdef SD_MOD
    setup_SD_Card();  // do SD card discovery & init TFT display
#endif


// NETWORK_TAG start setup

//*********************************** upstream wiFi setup  *******************
//Set DeviceId from wifi MAC address
String _apName = WiFi.macAddress();
_apName = "ESP32-" + _apName ;
_apName.replace(":","");
DeviceId=_apName;

//standalone = false ;
//wifi_enable = ! standalone  ; 
//AdminEnabled = false;

// check for standalone mode requested ( i.e. no network connection at all)
if(standalone){
    Serial.println("Starting in standalone mode (no WiFi upstream) by configuration ...");
    WiFi_AP_Setup();

    // mDNS startup
    String _mdnsName = WiFi.macAddress();
    _mdnsName = "ESP32-" + _mdnsName ;
    _mdnsName.replace(":","");
    if(!MDNS.begin(_mdnsName.c_str())){             // Start the mDNS responder for esp32.local
       Serial.println("Error setting up MDNS responder!");
      }
    else{
       Serial.printf("mDNS responder started (%s.local)\r",_mdnsName.c_str());
    };

     
    // modify TTL associated  with the domain name (in seconds) default is 60 seconds
    dnsServer.setTTL(300);
    // set which return code will be used for all other domains (e.g. sending ServerFailure instead of NonExistentDomain will reduce number of queries sent by clients)
    dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);// default is DNSReplyCode::NonExistentDomain
    // start DNS server for a specific domain name dnsServer.start(DNS_PORT, "www.example.com", apIP);
    dnsServer.start(DNS_PORT, "lora.esp32", apIP);
    // setup NTP client
    //  timeClient.begin();
  
  }
else {   // NON standalone situation.. we need to initialize upstream network connections
    Serial.println("Starting in NO standalone mode with  WiFi Upstream / NTP enabled by configuration ...");
    Serial.print( "Setting WIFI_UPSTREAM\r\n" );
    // first of all perform a wifi scanning to discover upream WiFi networks available
    wifi_scan_serial();
    WiFi_Upstream_Setup();  // this will take care of most of the STA mode setup    
    // mDNS startup
    String _mdnsName = WiFi.macAddress();
    _mdnsName = "ESP32-" + _mdnsName ;
    _mdnsName.replace(":","");
    if(!MDNS.begin(_mdnsName.c_str())){             // Start the mDNS responder for esp32.local
       Serial.println("Error setting up MDNS responder!");
      }
    else{
       Serial.printf("mDNS responder started (%s.local)\r",_mdnsName.c_str());
    };
      
    // modify TTL associated  with the domain name (in seconds) default is 60 seconds
    dnsServer.setTTL(300);
    // set which return code will be used for all other domains (e.g. sending ServerFailure instead of NonExistentDomain will reduce number of queries sent by clients)
    dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);// default is DNSReplyCode::NonExistentDomain
    // start DNS server for a specific domain name dnsServer.start(DNS_PORT, "www.example.com", apIP);
    dnsServer.start(DNS_PORT, "lora.esp32", apIP);
    // setup NTP client
    //  timeClient.begin();
};  // end of standalone check

// NETWORK_TAG end

#ifndef FORCE_SERIAL_DEBUG
  Serial.printf("Starting RemoteDebug...\r" );
  // Initialize the server (telnet or web socket) of RemoteDebug
  RemoteDebug_Setup();  // from nowon we can use debugA to issue advices on both the seral and remote consoleif enabled
#endif


//****************************** syslog service setup ***************************************
// prepare syslog configuration here (can be anywhere before first call of log/logf method)
// full ref. https://github.com/arcao/Syslog/blob/master/examples/AdvancedLogging/AdvancedLogging.ino#L72
// Syslog server connection info
if(syslog_enable) {
  #ifdef WIFI_UPSTREAM
    if( ! standalone){     
      debugA("Start Syslog server connection .... \r");
      SyslogDeviceName = WiFi.macAddress();
      SyslogDeviceName = "ESP32-" + SyslogDeviceName ;
      SyslogDeviceName.replace(":","");
      syslog.server(SYSLOG_SERVER, SYSLOG_PORT);
      syslog.deviceHostname(SyslogDeviceName.c_str());
      syslog.appName(APP_NAME);
      syslog.defaultPriority(LOG_LOCAL0);
      syslog_initialized = true ;   // the server is now setup ... but the connection could be not jet available
      if(! wifi_unavailable) { 
        syslog.logf(LOG_INFO, "%s: Starting %s syslog service at %s", VersionBanner.c_str(),  SyslogDeviceName.c_str(), (UTC.dateTime(ezt::now(), "d/n/Y H:i:s.v T")).c_str());
        syslog_available = true ;
        debugA("Syslog server connection started (%s)\r", SyslogDeviceName.c_str());
        } 
      else {
        syslog_available = false ;
        debugA("Syslog server connection not jet available (%s)\r", SyslogDeviceName.c_str());
        };
      }
    else {
      syslog_available = false ;
      syslog_initialized = false ;
      debugA("Syslog server connection is disabled (because upstream network is disabled)!\r");  
    };
  #else
    debugA("Syslog server connection is unavailable due to missing upstream network connection )!\r");
    syslog_initialized = false ;
    syslog_available = false ;
  #endif
  }
else {  
  debugA("Syslog server connection is disabled by Configuration!\r");
  syslog_initialized = false ;
  syslog_available = false ;
  };



