IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.1.cpp
//*********************  initialize mDash remote controller *******************
/*   VOID
mDashSetLogLevel("3");
mDashBegin(DEVICE_PASSWORD);
mDashSetLogLevel("3");
*/

//**************** initialize OTA  ***************************************

#ifdef USE_ARDUINO_OTA
  if( Admin_Mode) { 
    debugA("Perform OTA setup .... \r");
    OTA_setup();
  };   
#endif

red_flash();   // flash red led 

//******************************  management webserver startup **************************
WebServer_Init();
debugA("management web server started...\r"); 

//******************************  init random number generator **************************

randomSeed(millis()%10);              // initialize pseudo-random randon numeber generator

if(syslog_available) syslog.log(LOG_INFO, "========= END_OF_GENERIC_TAG ===========");




// END_OF_GENERIC_TAG

if( ! Admin_Mode) {     // start of addons initialization 
  // *************************  initialize AprsLogger parameters  ************************************
  udpAddress = ESP_Config.AprsLoggerAddr;
  udpPort = ESP_Config.AprsLoggerPort;
  debugA("Aprs Logger Parameters:  %s:%d\r", udpAddress.c_str(), udpPort);

  // *************************  initialize gps engine  ************************************
  //   if(syslog_available) syslog.log(LOG_INFO, "========= initialize gps engine ===========");

  Loc_Lat = ESP_Config.Loc_Lat; // initialize our default by GUI location if available
  Loc_Lon = ESP_Config.Loc_Lon;
  debugA("Location Coordinates by GUI defaults:  (%s / %s)\r", Loc_Lat.c_str(), Loc_Lon.c_str());
   
  //******************** create task to perform LocationManager operation ***************************//    if(syslog_available) syslog.log(LOG_INFO, "========= initialize LocationManager ===========");
    
  debugA("Create LocationManager task to perform geo location update\r"); 
  //create a task that will execute the LocationManager() function, with priority 1 and executed on core 1
  // it is up to LocationManager to initialize GPS engine and allow to have always
  // a consistent location value also if GPS is not available or invalid
  xTaskCreatePinnedToCore(
                    LocationManager,   // Task function. 
                    "LocationManager", // name of task. 
                    10000,            // Stack size of task 
                    NULL,             // parameter of the task 
                    1,                // priority of the task 
                    &LocationManager_handle,  // Task handle to keep track of created task 
                    0);               // pin task to core 0                   

  vTaskDelay(pdMS_TO_TICKS(500));
  LocationManager_flag = true ;  // start LocationManager disabled to allow further initialiation  
  vTaskDelay(pdMS_TO_TICKS(2000));
  // LocationManager services should now be up&running

  debugA("\rGPS engine should be now up&running \r"); 
  //******************* Initialize time related services for DS3231, NTP and GPS operation  **********************//   if(syslog_available) syslog.log(LOG_INFO, "========= initialize time related services ===========");
  //******************** create task to perform ClockManager operation ***************************
  debugA("Create ClockManager task to perform local time clock update\r"); 
  //create a task that will execute the ClockManager() function, with priority 1 and executed on core 1
  // it is up to ClockManager to initialize connection with GPS engine, DS3231 and allow to have always
  // a consistent clock value also if GPS or DS3231 is not available or invalid
  xTaskCreatePinnedToCore(
                    ClockManager,     // Task function. 
                    "ClockManager",   // name of task. 
                    10000,            // Stack size of task 
                    NULL,             // parameter of the task 
                    1,                // priority of the task 
                    &ClockManager_handle,  // Task handle to keep track of created task 
                    0);               // pin task to core 0                   

  vTaskDelay(pdMS_TO_TICKS(500));
  ClockManager_flag = true ;  // start ClockManager enabled to allow further initialiation  
  vTaskDelay(pdMS_TO_TICKS(2000));
  // ClockManager services should now be up&running

  debugA("\rClockManager should be now up&running \r"); 

  //******************   support for ezTime high precision time library ***************************
  // ezTime library  https://github.com/ropg/ezTime
  // global GPS eTime support variables
  timeStatus_t GPS_time_status ;
  timeStatus_t NTP_time_status ;

  #include "ezTime_loc.h"      // local copy patched by MF for GPS/RTC integration


  // time related func prototypes
  time_t nowUTC(const bool update_last_read );
  const long  gmtOffset_sec = 3600;
  const int   daylightOffset_sec = 3600;

  // ************************  Initialize Current measurement ******************************************
  #ifdef INA219_MOD
    monitor_24.begin();
    monitor_5.begin();  
    // begin calls:
    // configure() with default values RANGE_32V, GAIN_8_320MV, ADC_12BIT, ADC_12BIT, CONT_SH_BUS
    // calibrate() with default values D_SHUNT=0.1, D_V_BUS_MAX=32, D_V_SHUNT_MAX=0.2, D_I_MAX_EXPECTED=2
    // in order to work directly with ADAFruit's INA219B breakout
    //  monitor.configure(INA219::RANGE_32V, INA219::GAIN_8_320MV, INA219::ADC_64SAMP, INA219::ADC_64SAMP, INA219::CONT_SH_BUS);
    //  monitor_5.configure(INA219::RANGE_32V, INA219::GAIN_8_320MV, INA219::ADC_64SAMP, INA219::ADC_64SAMP, INA219::CONT_SH_BUS);
    #ifdef PS_FUNCTIONS_ENABLE
      //   tk_ps_mon.attach(5,loop_PS);
      Bat_discarge= false;   // battery is not discarging
    #endif

    // enable upstream battery connection
      RED_LED_enable();   
  #endif
      
//*************************  Set webclient and mqtt test *******************************
#ifdef WEBCLIENT_TEST_ENABLE  
  //   if(syslog_available) syslog.log(LOG_INFO, "========= initialize webclient and mqtt ===========");
  // start webclient test to check internet connectivity
  tk60WebClient.attach(60,loop_W5500_WebClient);
#endif

void test_beacon(void);
//  tk30Second.attach(35,test_beacon);  // to test beacon operation sending a beacon every 30 secs

