IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.1.cpp
  //******************** global loop for core management activities  **************************************
  loop_global();   // serve web management GUI interface on port 80
  Debug_Loop();    // Serve common Remote and Serial Debug console:over serial, telnet, websocket running on port 23 / 8232

  #ifdef USE_ARDUINO_OTA   
  if( Admin_Mode) {  
    OTA_loop();  // OTA SW update support on port 88 if in admin mode
    };
  #endif

  //============================== local display update ===============================================
  LocalDisplayUpdate();

  //============================== pushbutton status update ================================================
  if( millis() - last_button_millis >= 100 ){   // pushbutton polling
    last_button_millis = millis();
    check_button();
  };

  #ifndef DEBUG_DISABLED
  // Show a debug - warning if time of these loop is over 50 (info) or 100 ms (warning)
  uint32_t time = (millis() - timeBeginLoop);
  if (time > 1000) {
    debugI("* Time elapsed for the loop: %u ms.", time);
    } 
  else if (time > 1050) {
    debugW("* Time elapsed for the loop: %u ms.", time);
    };
  #endif  // DEBUG_DISABLED  4
   
  //============================== local DNS server update ================================================   
  if(! standalone ){
    // serve DNS requests
    dnsServer.processNextRequest();
  };

  //============================== dummy loop time consumer ================================================
 
  #ifndef LORA_FUNCTIONS_ENABLE   
    vTaskDelay(pdMS_TO_TICKS(200));  // just give time to see the green_led flashing....
  #endif 

  //============================== activity led disable ================================================   
  if(activity_flag) {
    GREEN_LED_disable();
    activity_flag = false ;
    activity_time = millis() - activity_start;
  };
    
}    // end of main loop

//  LOOP_END_TAG


void loop_test(){
  Serial.print(".");
  debugA("* This is a message of debug level VERBOSE");
	debugD("* This is a message of debug level DEBUG");
	debugI("* This is a message of debug level INFO");
	debugW("* This is a message of debug level WARNING");
  debugHandle();  
  vTaskDelay(pdMS_TO_TICKS(1000));
}



